TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
public:
  inline queue_mutex_guard() : holds_mutex(xSemaphoreTake(_async_queue_mutex, portMAX_DELAY)){};
  inline ~queue_mutex_guard() {
    if (holds_mutex) {
      xSemaphoreGive(_async_queue_mutex);
    }
  };
  inline explicit operator bool() const {
    return holds_mutex;
  };
};
}  // anonymous namespace

static SimpleIntrusiveList<lwip_tcp_event_packet_t> _async_queue;
static TaskHandle_t _async_service_task_handle = NULL;

static SemaphoreHandle_t _slots_lock = NULL;
static const int _number_of_closed_slots = CONFIG_LWIP_MAX_ACTIVE_TCP;
static uint32_t _closed_slots[_number_of_closed_slots];
static tcp_pcb *_pcb_slots[_number_of_closed_slots];
static AsyncClient *_client_slots[_number_of_closed_slots];
static uint32_t _closed_index = []() {
  _slots_lock = xSemaphoreCreateBinary();
  configASSERT(_slots_lock);  // Add sanity check
  xSemaphoreGive(_slots_lock);
  for (int i = 0; i < _number_of_closed_slots; ++i) {
    _closed_slots[i] = 1;
    _pcb_slots[i] = nullptr;
    _client_slots[i] = nullptr;
  }
  return 1;
}();

// Helper: Register and Unregister Clients
static AsyncClient *_clients[CONFIG_LWIP_MAX_ACTIVE_TCP];
static SemaphoreHandle_t _client_mutex;

s8_t _client_slot_available() {
  s8_t slot = INVALID_CLOSED_SLOT;
  xSemaphoreTake(_client_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (!_clients[i]) {
      slot = i;
      break;
    }
  }
  xSemaphoreGive(_client_mutex);
  return slot;
}

s8_t _register_client_slot(AsyncClient *client) {
  s8_t slot = INVALID_CLOSED_SLOT;
  xSemaphoreTake(_client_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (!_clients[i]) {
      _clients[i] = client;
      slot = i;
      break;
    }
  }
  xSemaphoreGive(_client_mutex);
  return slot;
}

s8_t _unregister_client_slot(AsyncClient *client) {
  s8_t slot = INVALID_CLOSED_SLOT;
  xSemaphoreTake(_client_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (_clients[i] == client) {
      _clients[i] = NULL;
      slot = i;
      break;
    }
  }
  xSemaphoreGive(_client_mutex);
  return slot;
}

bool _is_client_slot_valid(AsyncClient *client) {
  bool valid = false;
  xSemaphoreTake(_client_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (_clients[i] == client) {
      valid = true;
      break;
    }
  }
  xSemaphoreGive(_client_mutex);
  return valid;
}

static inline bool _is_pcb_slot_valid(int8_t slot, tcp_pcb *pcb) {
  bool valid;
  xSemaphoreTake(_slots_lock, portMAX_DELAY);
  valid = (slot > INVALID_CLOSED_SLOT && slot < _number_of_closed_slots && _pcb_slots[slot] == pcb);
  xSemaphoreGive(_slots_lock);
  return valid;
}

static void _free_event(lwip_tcp_event_packet_t *evpkt) {
  if ((evpkt->event == LWIP_TCP_RECV) && (evpkt->recv.pb != nullptr)) {
    ASYNC_TCP_CONSOLE("Free ev: client %u slot = %d pb = %u", evpkt->client, evpkt->client->closedSlot(), evpkt->recv.pb);
    pbuf_free(evpkt->recv.pb);
  }
  delete evpkt;
}

static inline void _send_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_back(e);
  xTaskNotifyGive(_async_service_task_handle);
}

static inline void _prepend_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_front(e);
  xTaskNotifyGive(_async_service_task_handle);
}

static inline lwip_tcp_event_packet_t *_get_async_event() {
  queue_mutex_guard guard;
  while (1) {
    lwip_tcp_event_packet_t *e = _async_queue.pop_front();

    if ((!e) || (e->event != LWIP_TCP_POLL)) {
      return e;
    }

    /*
      Let's try to coalesce two (or more) consecutive poll events into one
      this usually happens with poor implemented user-callbacks that are runs too long and makes poll events to stack in the queue
      if consecutive user callback for a same connection runs longer that poll time then it will fill the queue with events until it deadlocks.
      This is a workaround to mitigate such poor designs and won't let other events/connections to starve the task time.
      It won't be effective if user would run multiple simultaneous long running callbacks due to message interleaving.
      todo: implement some kind of fair dequeuing or (better) simply punish user for a bad designed callbacks by resetting hog connections
    */
    for (lwip_tcp_event_packet_t *next_pkt = _async_queue.begin(); next_pkt && (next_pkt->client == e->client) && (next_pkt->event == LWIP_TCP_POLL);
         next_pkt = _async_queue.begin()) {
      // if the next event that will come is a poll event for the same connection, we can discard it and continue
      _free_event(_async_queue.pop_front());
      log_d("coalescing polls, network congestion or async callbacks might be too slow!");
    }

    /*
      now we have to decide if to proceed with poll callback handler or discard it?
      poor designed apps using asynctcp without proper dataflow control could flood the queue with interleaved pool/ack events.
      I.e. on each poll app would try to generate more data to send, which in turn results in additional ack event triggering chain effect
      for long connections. Or poll callback could take long time starving other connections. Anyway our goal is to keep the queue length
      grows under control (if possible) and poll events are the safest to discard.
      Let's discard poll events processing using linear-increasing probability curve when queue size grows over 3/4
      Poll events are periodic and connection could get another chance next time
    */
    if (_async_queue.size() > (rand() % CONFIG_ASYNC_TCP_QUEUE_SIZE / 4 + CONFIG_ASYNC_TCP_QUEUE_SIZE * 3 / 4)) {
      _free_event(e);
      log_d("discarding poll due to queue congestion");
      continue;
    }

    return e;
  }
}

static void _remove_events_for_client(AsyncClient *client) {
  lwip_tcp_event_packet_t *removed_event_chain;
  {
    queue_mutex_guard guard;
    removed_event_chain = _async_queue.remove_if([client](lwip_tcp_event_packet_t &pkt) {
      return pkt.client == client;
    });
  }

  while (removed_event_chain) {
    auto t = removed_event_chain;
    removed_event_chain = t->next;
    _free_event(t);
  }
};

