TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
static esp_err_t _tcp_recved(tcp_pcb *pcb, int8_t closed_slot, size_t len) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.closed_slot = closed_slot;
  msg.received = len;
  tcpip_api_call(_tcp_recved_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_close_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->closed_slot, msg->pcb)) {
    _reset_tcp_callbacks(msg->pcb, (AsyncClient *)msg->close.arg);
    msg->err = tcp_close(msg->pcb);
    if (msg->err != ERR_OK) {
      tcp_abort(msg->pcb);
      msg->err = ERR_ABRT;
    }
    if (msg->close.cb) {
      msg->close.cb(msg->close.arg);
    }
  }
  return msg->err;
}

static esp_err_t _tcp_close(tcp_pcb *pcb, tcp_close_callback cb, void *arg) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.close.cb = cb;
  msg.close.arg = arg;
  tcpip_api_call(_tcp_close_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_abort_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (_is_pcb_slot_valid(msg->closed_slot, msg->pcb)) {
    tcp_abort(msg->pcb);
    msg->err = ERR_ABRT;
  }
  return msg->err;
}

static esp_err_t _tcp_abort(tcp_pcb *pcb, int8_t closed_slot) {
  if (!pcb) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.closed_slot = closed_slot;
  tcpip_api_call(_tcp_abort_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_connect_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  tcp_arg(msg->pcb, msg->connect.arg);
  msg->err = tcp_connect(msg->pcb, msg->connect.addr, msg->connect.port, msg->connect.cb);
  if (msg->err != ERR_OK) {
    ASYNC_TCP_CONSOLE("Error %d", msg->err);
    tcp_abort(msg->pcb);
    msg->err = ERR_ABRT;

  }
  return msg->err;
}

static esp_err_t _tcp_connect(tcp_pcb *pcb, int8_t closed_slot, ip_addr_t *addr, uint16_t port, tcp_connected_fn cb, void *arg) {
  if (!pcb) {
    return ESP_FAIL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.closed_slot = closed_slot;
  msg.connect.addr = addr;
  msg.connect.port = port;
  msg.connect.cb = cb;
  msg.connect.arg = arg;
  tcpip_api_call(_tcp_connect_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _dns_gethostbyname_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = dns_gethostbyname(msg->dns_found.name, msg->dns_found.addr, msg->dns_found.cb, msg->dns_found.arg);
  return msg->err;
}

static esp_err_t _dns_gethostbyname(const char *hostname, ip_addr_t *addr, dns_found_callback found, void *arg) {
  tcp_api_call_t msg;
  msg.dns_found.name = hostname;
  msg.dns_found.addr = addr;
  msg.dns_found.cb = found;
  msg.dns_found.arg = arg;
  tcpip_api_call(_dns_gethostbyname_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_new_ip_type_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  msg->pcb = tcp_new_ip_type(msg->new_ip.type);
  return msg->err;
}

static tcp_pcb *_tcp_new_ip_type(u8_t type) {
  tcp_api_call_t msg;
  msg.new_ip.type = type;
  tcpip_api_call(_tcp_new_ip_type_api, (struct tcpip_api_call_data *)&msg);
  return msg.pcb;
}

static err_t _tcp_bind_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = tcp_bind(msg->pcb, msg->bind.addr, msg->bind.port);
  if (msg->err != ERR_OK) {
    tcp_abort(msg->pcb); // forcibly free unbound PCB
    msg->err = ERR_ABRT;
  }
  return msg->err;
}

static esp_err_t _tcp_bind(tcp_pcb *pcb, ip_addr_t *addr, uint16_t port) {
  if (!pcb) {
    return ESP_FAIL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.bind.addr = addr;
  msg.bind.port = port;
  tcpip_api_call(_tcp_bind_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_listen_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  msg->pcb = tcp_listen_with_backlog(msg->pcb, msg->backlog);
  return msg->err;
}

static tcp_pcb *_tcp_listen_with_backlog(tcp_pcb *pcb, uint8_t backlog) {
  if (!pcb) {
    return NULL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.backlog = backlog ? backlog : 0xFF;
  tcpip_api_call(_tcp_listen_api, (struct tcpip_api_call_data *)&msg);
  return msg.pcb;
}

/*
  Async TCP Client
 */

static void _do_discard_client(void *r, AsyncClient *c) {
  delete c;
}

void asynctcp_callback(asynctcp_callback_fn function, void *ctx) {
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_CALLBACK, nullptr};
  if (!e) {
    log_e("Failed to allocate event packet");
    return;
  }
  e->callback.fn = function;
  e->callback.arg = ctx;

  queue_mutex_guard guard;
  _send_async_event(e);
}

AsyncClient::AsyncClient(tcp_pcb *pcb, AsyncServer *server)
  : _is_valid(false), _pcb(pcb), _server(server), _connect_cb(0), _connect_cb_arg(0), _discard_cb(0), _discard_cb_arg(0), _sent_cb(0), _sent_cb_arg(0), _error_cb(0),
    _error_cb_arg(0), _recv_cb(0), _recv_cb_arg(0), _pb_cb(0), _pb_cb_arg(0), _timeout_cb(0), _timeout_cb_arg(0), _poll_cb(0), _poll_cb_arg(0), _ack_pcb(true),
    _tx_last_packet(0), _rx_timeout(0), _rx_last_ack(0), _rx_ack_len(0), _ack_timeout(CONFIG_ASYNC_TCP_MAX_ACK_TIME), _connect_port(0) {
      ASYNC_TCP_CONSOLE("%u: New client", this);
    }

AsyncClient::~AsyncClient() {
  ASYNC_TCP_CONSOLE("%u: delete client", this);
  if (_is_valid) {
    resetCallback();  // avoid any recursive callback
    close(true); // close immediately in LwIP thread
  }
}

/*
 * Operators
 * */

bool AsyncClient::operator==(const AsyncClient &other) const {
  return _pcb == other._pcb;
}

