TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
/*
 * Callback Setters
 * */

void AsyncClient::onConnect(AcConnectHandler cb, void *arg) {
  _connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncClient::onDisconnect(AcConnectHandler cb, void *arg) {
  _discard_cb = cb;
  _discard_cb_arg = arg;
  if (!_discard_cb) {
    _discard_cb = _do_discard_client;
  }
}

void AsyncClient::onAck(AcAckHandler cb, void *arg) {
  _sent_cb = cb;
  _sent_cb_arg = arg;
}

void AsyncClient::onError(AcErrorHandler cb, void *arg) {
  _error_cb = cb;
  _error_cb_arg = arg;
}

void AsyncClient::onData(AcDataHandler cb, void *arg) {
  _recv_cb = cb;
  _recv_cb_arg = arg;
}

void AsyncClient::onPacket(AcPacketHandler cb, void *arg) {
  _pb_cb = cb;
  _pb_cb_arg = arg;
}

void AsyncClient::onTimeout(AcTimeoutHandler cb, void *arg) {
  _timeout_cb = cb;
  _timeout_cb_arg = arg;
}

void AsyncClient::onPoll(AcConnectHandler cb, void *arg) {
  _poll_cb = cb;
  _poll_cb_arg = arg;
}

/*
 * Main Public Methods
 * */

bool AsyncClient::connect(ip_addr_t addr, uint16_t port) {
  if (_pcb) {
    log_d("already connected, state %d", _pcb->state);
    return false;
  }
  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  ASYNC_TCP_CONSOLE("%u port: %u", this, port);

  if (_client_slot_available() == INVALID_CLOSED_SLOT) {
    log_e("client slot full");
    return false;
  }
  
  tcp_pcb *pcb;
#if LWIP_IPV4 && LWIP_IPV6
  pcb = _tcp_new_ip_type(addr.type);
#else
  pcb = _tcp_new_ip_type(IPADDR_TYPE_V4);
#endif
  if (!pcb) {
    log_e("pcb == NULL");
    return false;
  }

  _pcb = pcb;
  esp_err_t err = _tcp_connect(pcb, _closed_slot, &addr, port, AsyncTCP_detail::tcp_connected, this);
  bool result = (err == ESP_OK);
  if (!result) {
    log_e("tcp_connect failed: %d", err);
  }
  return result;
}

#ifdef ARDUINO
bool AsyncClient::connect(const IPAddress &ip, uint16_t port) {
  ip_addr_t addr;
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  // if both IPv4 and IPv6 are enabled, ip_addr_t has a union field and the address type
  addr.u_addr.ip4.addr = ip;
  addr.type = IPADDR_TYPE_V4;
#else
  addr.addr = ip;
#endif
#else
  ip.to_ip_addr_t(&addr);
#endif
  ASYNC_TCP_CONSOLE("%u IP %s, port: %u", this, ip.toString().c_str(), port);
  return connect(addr, port);
}
#endif

#if LWIP_IPV6 && ESP_IDF_VERSION_MAJOR < 5
bool AsyncClient::connect(const IPv6Address &ip, uint16_t port) {
  auto ipaddr = static_cast<const uint32_t *>(ip);
  ip_addr_t addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);

  return connect(addr, port);
}
#endif

bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  ASYNC_TCP_CONSOLE("%u host %s, port: %u", this, host, port);

  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  _connect_port = port;
  err_t err = _dns_gethostbyname(host, &addr, AsyncTCP_detail::_tcp_dns_found, this);

  if (err == ERR_OK) {
    ASYNC_TCP_CONSOLE("IP: %s\n", ipaddr_ntoa(&addr));
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV6
    if (addr.type == IPADDR_TYPE_V6) {
      return connect(IPv6Address(addr.u_addr.ip6.addr), port);
    }
    return connect(IPAddress(addr.u_addr.ip4.addr), port);
#else
    return connect(IPAddress(addr.addr), port);
#endif
#else
    return connect(addr, port);
#endif
  } else if (err == ERR_INPROGRESS) {
    ASYNC_TCP_CONSOLE("DNS query sent, waiting for callback...\n");
    return true;
  }
  ASYNC_TCP_CONSOLE("error: %d", err);
  return false;
}

/**
 * _close(), _tcp_close(),  _free_closed_slot() --> onDisconnect() --> ~AsyncClient()
*/
void AsyncClient::close(bool thread) {
  if (!_is_pcb_slot_valid(_closed_slot, _pcb)) {
    return;
  }

  if (IN_LWIP_THREAD == thread) {
    _close(); // client shall be closed directly in lwIP thread 
  } else {
    // callback shall be scheduled in Async thread.
    asynctcp_callback([](void *arg) {
      // run in Async thread 
      AsyncClient *client = (AsyncClient *)arg;
      client->_close(); // client shall be closed directly in lwIP thread 
    }, this);
  }
}

/**
 * _tcp_abort() --> tcp_error(), _free_closed_slot() --> _error() -->onDisconnect() --> ~AsyncClient()
*/
err_t AsyncClient::abort() {
  if (!_is_pcb_slot_valid(_closed_slot, _pcb)) {
    return ERR_ABRT;
  }

  if (_pcb) {
    ASYNC_TCP_CONSOLE("%u", this);
    _tcp_abort(_pcb, _closed_slot);
    _pcb = NULL;
  }
  return ERR_ABRT;
}

size_t AsyncClient::space() const {
  if ((_pcb != NULL) && (_pcb->state == ESTABLISHED)) {
    return tcp_sndbuf(_pcb);
  }
  return 0;
}

size_t AsyncClient::add(const char *data, size_t size, uint8_t apiflags) {
  if (!_pcb || size == 0 || data == NULL) {
    return 0;
  }
  size_t room = space();
  if (!room) {
    return 0;
  }
  size_t will_send = (room < size) ? room : size;
  err_t err = ERR_OK;
  err = _tcp_write(_pcb, _closed_slot, data, will_send, apiflags);
  if (err != ERR_OK) {
    return 0;
  }
  return will_send;
}

bool AsyncClient::send() {
  auto backup = _tx_last_packet;
  _tx_last_packet = millis();
  if (_tcp_output(_pcb, _closed_slot) == ERR_OK) {
    return true;
  }
  _tx_last_packet = backup;
  return false;
}

size_t AsyncClient::ack(size_t len) {
  if (len > _rx_ack_len) {
    len = _rx_ack_len;
  }
  _rx_ack_len -= len;
  return len;
}

void AsyncClient::ackPacket(struct pbuf *pb) {
  if (!pb) {
    return;
  }
  pbuf_free(pb);
}

/*
 * Main Private Methods
 * */

err_t AsyncClient::_close() {
  // ets_printf("X: 0x%08x\n", (uint32_t)this);
  err_t err = ERR_OK;
  tcpip_callback([](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    if (c->_pcb && c->_is_valid) {
      _reset_tcp_callbacks(c->_pcb, c); // It has to be called before tcp_close();
      if (tcp_close(c->_pcb) != ERR_OK) {
        tcp_abort(c->_pcb);
      }
    }
    _remove_events_for_client(c);
    _unregister_client_slot(c);
    c->_is_valid = false;
    c->_pcb = NULL;
  }, this);

  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
    _discard_cb = nullptr;
  }
  return err;
}

