TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
void AsyncClient::resetCallback() {
  _connect_cb = nullptr;
  _discard_cb = nullptr;
  _sent_cb = nullptr;
  _error_cb = nullptr;
  _recv_cb = nullptr;
  _pb_cb = nullptr;
  _timeout_cb = nullptr;
  _poll_cb = nullptr;
}

bool AsyncClient::_allocate_closed_slot() {
  bool allocated = false;
  xSemaphoreTake(_slots_lock, portMAX_DELAY);
  uint32_t closed_slot_min_index = 0;
  allocated = _closed_slot != INVALID_CLOSED_SLOT;
  if (!allocated) {
    for (int i = 0; i < _number_of_closed_slots; ++i) {
      if ((_closed_slot == INVALID_CLOSED_SLOT || _closed_slots[i] <= closed_slot_min_index) && _closed_slots[i] != 0) {
        closed_slot_min_index = _closed_slots[i];
        _closed_slot = i;
      }
    }
    allocated = _closed_slot != INVALID_CLOSED_SLOT;
  }
  if (allocated) {
    if(_pcb) ASYNC_TCP_CONSOLE("client %u: _closed_slot[%d] = 0", this, _closed_slot);
    _closed_slots[_closed_slot] = 0;
    _pcb_slots[_closed_slot] = _pcb;
  }
  xSemaphoreGive(_slots_lock);
  return allocated;
}

void AsyncClient::_free_closed_slot() {
  xSemaphoreTake(_slots_lock, portMAX_DELAY);
  if (_closed_slot != INVALID_CLOSED_SLOT) {
    ASYNC_TCP_CONSOLE("client %u: _closed_slot[%d] = %u", this, _closed_slot, _closed_index);
    _closed_slots[_closed_slot] = _closed_index;
    _pcb_slots[_closed_slot] = nullptr;
    _closed_slot = INVALID_CLOSED_SLOT;
    ++_closed_index;
    if (0 == _closed_index) {
      ++_closed_index;
    }
  }
  xSemaphoreGive(_slots_lock);
}

bool AsyncClient::valid() {
  return _is_pcb_slot_valid(_closed_slot, _pcb);
}

/*
 * Private Callbacks
 * */
err_t AsyncClient::_connected(tcp_pcb *pcb) {
  ASYNC_TCP_CONSOLE("%u", this);
  if (_pcb) {
    _rx_last_packet = millis();
  }
  _tx_last_packet = 0;
  _rx_last_ack = 0;
  if (_connect_cb) {
    _connect_cb(_connect_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_error(err_t err) {
  if (_error_cb) {
    _error_cb(_error_cb_arg, this, err);
  }
  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
    _discard_cb = nullptr;
  }
}

// In LwIP Thread
err_t AsyncClient::_lwip_fin(tcp_pcb *pcb, err_t err) {
  if (!_pcb || pcb != _pcb) {
    log_d("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }
  ASYNC_TCP_CONSOLE("%u", this);
  _reset_tcp_callbacks(_pcb, this);
  if (tcp_close(_pcb) != ERR_OK) {
    tcp_abort(_pcb);
    err = ERR_ABRT;
  }
  _free_closed_slot();
  _pcb = NULL;
  return err;
}

// In Async Thread
err_t AsyncClient::_fin(tcp_pcb *pcb, err_t err) {
  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
    _discard_cb = nullptr;
  }
  return ERR_OK;
}

void AsyncClient::_end() {
  if (_discard_cb) {
    ASYNC_TCP_CONSOLE("%u: disconnect", this);
    _discard_cb(_discard_cb_arg, this);
    _discard_cb = nullptr;
  }
}

err_t AsyncClient::_sent(tcp_pcb *pcb, uint16_t len) {
  _rx_last_ack = _rx_last_packet = millis();
  if (_sent_cb) {
    _sent_cb(_sent_cb_arg, this, len, (_rx_last_packet - _tx_last_packet));
  }
  return ERR_OK;
}

err_t AsyncClient::_recv(tcp_pcb *pcb, pbuf *pb, err_t err) {
  while (pb != NULL) {
    _rx_last_packet = millis();
    // we should not ack before we assimilate the data
    // _ack_pcb = true; // It is always true with whenever new client established. It should not force true here due to the ackLater() will not be valid anymore
    pbuf *b = pb;
    pb = b->next;
    b->next = NULL;
    if (_pb_cb) {
      _pb_cb(_pb_cb_arg, this, b);
    } else {
      if (_recv_cb) {
        _recv_cb(_recv_cb_arg, this, b->payload, b->len);
      }
      if (!_ack_pcb) {
        _rx_ack_len += b->len;
      }
      pbuf_free(b);
    }
  }
  return ERR_OK;
}

err_t AsyncClient::_poll(tcp_pcb *pcb) {
  if (!_pcb) {
    // log_d("pcb is NULL");
    return ERR_OK;
  }
  if (pcb != _pcb) {
    log_d("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }

  uint32_t now = millis();

  // ACK Timeout
  if (_ack_timeout) {
    const uint32_t one_day = 86400000;
    bool last_tx_is_after_last_ack = (_rx_last_ack - _tx_last_packet + one_day) < one_day;
    if (last_tx_is_after_last_ack && (now - _tx_last_packet) >= _ack_timeout) {
      log_d("ack timeout %d", pcb->state);
      if (_timeout_cb) {
        _timeout_cb(_timeout_cb_arg, this, (now - _tx_last_packet));
      }
      return ERR_OK;
    }
  }
  // RX Timeout
  if (_rx_timeout && (now - _rx_last_packet) >= (_rx_timeout * 1000)) {
    log_d("rx timeout %d", pcb->state);
    ASYNC_TCP_CONSOLE("%u: rx timeout", this);
    close(IN_ASYNC_THREAD);
    return ERR_OK;
  }
  // Everything is fine
  if (_poll_cb) {
    _poll_cb(_poll_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_dns_found(ip_addr_t *ipaddr) {
  if (ipaddr) {
    ASYNC_TCP_CONSOLE("IP: %s\n", ipaddr_ntoa(ipaddr));
    connect(*ipaddr, _connect_port);
  } else {
    if (_error_cb) {
      _error_cb(_error_cb_arg, this, -55);
    }
    if (_discard_cb) {
      ASYNC_TCP_CONSOLE("%u: disconnect", this);
      _discard_cb(_discard_cb_arg, this);
      _discard_cb = nullptr;
    }
  }
}

/*
 * Public Helper Methods
 * */

bool AsyncClient::free() {
  if (!_pcb) {
    return true;
  }
  if (_pcb->state == CLOSED || _pcb->state > ESTABLISHED) {
    return true;
  }
  return false;
}

size_t AsyncClient::write(const char *data, size_t size, uint8_t apiflags) {
  size_t will_send = add(data, size, apiflags);
  if (!will_send || !send()) {
    return 0;
  }
  return will_send;
}

void AsyncClient::setRxTimeout(uint32_t timeout) {
  _rx_timeout = timeout;
}

uint32_t AsyncClient::getRxTimeout() const {
  return _rx_timeout;
}

uint32_t AsyncClient::getAckTimeout() const {
  return _ack_timeout;
}

void AsyncClient::setAckTimeout(uint32_t timeout) {
  _ack_timeout = timeout;
}

void AsyncClient::setNoDelay(bool nodelay) const {
  if (!_pcb) {
    return;
  }
  if (nodelay) {
    tcp_nagle_disable(_pcb);
  } else {
    tcp_nagle_enable(_pcb);
  }
}

bool AsyncClient::getNoDelay() {
  if (!_pcb) {
    return false;
  }
  return tcp_nagle_disabled(_pcb);
}

