TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
AsyncServer::AsyncServer(uint16_t port) : _port(port), _noDelay(false), _pcb(0), _listen_connect_cb(0), _connect_cb_arg(0) {
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_ANY;
  _addr.u_addr.ip4.addr = INADDR_ANY;
#else
  _addr.addr = INADDR_ANY;
#endif
}

AsyncServer::~AsyncServer() {
  end();
}

void AsyncServer::onClient(AcConnectHandler cb, void *arg) {
  _listen_connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncServer::begin() {
  if (_pcb) {
    return;
  }

  if (!_start_async_task()) {
    log_e("failed to start task");
    return;
  }

  // Safely to run in the LwIP thread
  tcpip_callback([](void *arg) {
    AsyncServer *server = (AsyncServer *)arg;
    err_t err;
#if LWIP_IPV4 && LWIP_IPV6
    server->_pcb = tcp_new_ip_type(server->_addr.type);
#else
    _pcb = _tcp_new_ip_type(IPADDR_TYPE_ANY);
#endif
    if (!server->_pcb) {
      log_e("_pcb == NULL");
      return;
    }

    err = tcp_bind(server->_pcb, &server->_addr, server->_port);

    if (err != ERR_OK) {
      log_e("bind error: %d", err);
      tcp_abort(server->_pcb); // forcibly free unbound PCB
      server->_pcb = NULL;
      return;
    }

    constexpr uint8_t backlog = CONFIG_LWIP_MAX_ACTIVE_TCP / 2; // up to you
    server->_pcb = tcp_listen_with_backlog(server->_pcb, backlog);
    if (!server->_pcb) {
      log_e("listen_pcb == NULL");
      return;
    }
    tcp_arg(server->_pcb, (void *)server);
    tcp_accept(server->_pcb, &AsyncTCP_detail::tcp_accept);
  }, this);
}

void AsyncServer::end() {
  tcpip_callback([](void *arg) {
    // run in LwIP thread
    AsyncServer *s = (AsyncServer *)arg;
    if (s->_pcb) {
      tcp_arg(s->_pcb, NULL);
      tcp_accept(s->_pcb, NULL);
      if (tcp_close(s->_pcb) != ERR_OK) {
        tcp_abort(s->_pcb);
      }
      s->_pcb = NULL;
    }
  }, this);

  xSemaphoreTake(_client_mutex, portMAX_DELAY);
  for (int i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    AsyncClient *c = _clients[i];
    if (c && c->_is_valid && c->_server == this) {
      c->close(true); // close immediately in LwIP thread
      delete c;
    }
  }
  xSemaphoreGive(_client_mutex);
}

err_t AsyncServer::_accepted(AsyncClient *client) {
  if (_listen_connect_cb) {
    _listen_connect_cb(_connect_cb_arg, client);
  }
  return ERR_OK;
}

void AsyncServer::setNoDelay(bool nodelay) {
  _noDelay = nodelay;
}

bool AsyncServer::getNoDelay() const {
  return _noDelay;
}

uint8_t AsyncServer::status() const {
  if (!_pcb) {
    return 0;
  }
  return _pcb->state;
}
